app/Http/Controllers/RegisterController.php

insert into `members` (`name_sei`, `name_mei`, `nickname`, `gender`, `password`, `email`, `updated_at`, `created_at`) values ('池田', '隼人', '池田さん', '1', 'y$s4rEbJjBLhkE8UZgIAwUAuxH/d4.DiUbPfG21Ec5BmAb7qIs0.Z5e', 'ike@gmail.com', '2021-08-09 14:19:40', '2021-08-09 14:19:40')
---
        public function send(Request $request){
  		//セッションから値を取り出す
        $input = $request->session()->get("form_input");

        //戻るボタンが押された時
		if($request->has("back")){
		return redirect()->action("RegisterController@form")
		->withInput($input);
		}

        //セッションに値が無い時はフォームに戻る
        if(!$input){
        return redirect()->action("RegisterController@form");
        }

        //ここでメールを送信、DBへの登録するなどを行う
        Mail::to($input["email"])->send(new CompleteMail($input["name_sei"]));

        $member = new Member();
        $member->name_sei = $input["name_sei"];
        $member->name_mei = $input["name_mei"];
        $member->nickname = $input["nickname"];
        $member->gender = $input["gender"];
        $member->password = bcrypt($input["password"]);
        $member->email = $input["email"];

        $member->save();